# IExtension Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExtension Interface
Members See Also
---
An interface that supports the additional operation for Extension Status
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IExtension
```

Visual Basic
---
```text
Public Interface IExtension
```

Visual C++
---
```text
public interface class IExtension
```

# Remarks
# See Also
IExtension Members
Autodesk.Revit.DB Namespace